IRP/src/Documents/ExpenseAccruals/ExpenseAccruals.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ExpenseAccruals</name>
  <registerRecords>AccumulationRegister.R5022T_Expenses</registerRecords>
  <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
  <registerRecords>AccumulationRegister.R6070T_OtherPeriodsExpenses</registerRecords>
  <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionType</name>
    <type>
      <types>EnumRef.AccrualsTransactionType</types>
    </type>
  </attributes>
  <attributes>
    <name>Basis</name>
    <type>
      <types>DocumentRef.PurchaseInvoice</types>
      <types>DocumentRef.ExpenseAccruals</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CostList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>ProfitLossCenter</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ExpenseType</name>
      <type>
        <types>CatalogRef.ExpenseAndRevenueTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>AdditionalAnalytic</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.Projects</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IsFixed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/AccumulationRegisters/R6070T_OtherPeriodsExpenses/R6070T_OtherPeriodsExpenses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R6070T_OtherPeriodsExpenses</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AmountTax</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RowID</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Basis</name>
  <type>
   <types>DocumentRef.PurchaseInvoice</types>
   <types>DocumentRef.ExpenseAccruals</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>OtherPeriodExpenseType</name>
  <type>
   <types>EnumRef.OtherPeriodExpenseType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/OtherPeriodExpenseType/OtherPeriodExpenseType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>OtherPeriodExpenseType</name>
 <enumValues>
  <name>ItemsCost</name>
 </enumValues>
 <enumValues>
  <name>ExpenseAccruals</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/AccrualsTransactionType/AccrualsTransactionType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AccrualsTransactionType</name>
 <enumValues>
  <name>Accrual</name>
 </enumValues>
 <enumValues>
  <name>Void</name>
 </enumValues>
 <enumValues>
  <name>Reverse</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/ExpenseAccruals/Forms/PickupExpenseForm/Module.bsl
// @strict-types

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	FillExpenseValueTable();
EndProcedure


#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure ExpenseValueTableSelection(Item, RowSelected, Field, StandardProcessing)
	CurrentData = Items.ExpenseValueTable.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;	
	
	Result = New Array();
	Result.Add(New Structure("Amount, Basis", CurrentData.Amount, CurrentData.Document));
	Close(Result);		
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure FillExpenseValueTable()
	Query = New Query();
	Query.Text = 
	"SELECT
	|	R6070T_OtherPeriodsExpenses.Basis AS Document,
	|	R6070T_OtherPeriodsExpenses.Currency AS Currency,
	|	R6070T_OtherPeriodsExpenses.TransactionCurrency AS TransactionCurrency,
	|	R6070T_OtherPeriodsExpenses.CurrencyMovementType AS CurrencyMovementType,
	|	R6070T_OtherPeriodsExpenses.AmountBalance AS Amount
	|FROM
	|	AccumulationRegister.R6070T_OtherPeriodsExpenses.Balance(&BalancePeriod, Company = &Company
	|	AND Branch = &Branch
	|	AND CurrencyMovementType = &CurrencyMovementType
	|	AND OtherPeriodExpenseType = VALUE(Enum.OtherPeriodExpenseType.ExpenseAccruals)
	|	AND Currency = &Currency
	|	AND CASE
	|		WHEN &TransactionType = VALUE(Enum.AccrualsTransactionType.Accrual)
	|			THEN Basis REFS Document.PurchaseInvoice
	|		ELSE Basis REFS Document.ExpenseAccruals
	|	END) AS R6070T_OtherPeriodsExpenses";
	
	Query.SetParameter("Company", Parameters.Company);
	Query.SetParameter("Branch", Parameters.Branch);
	Query.SetParameter("CurrencyMovementType", ChartsOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency);
	Query.SetParameter("Currency", Parameters.Currency);
	Query.SetParameter("TransactionType", Parameters.TransactionType);
	
//	CurrentTransactionType = Parameters.TransactionType;
//	If CurrentTransactionType = Enums.AccrualsTransactionType.Accrual Then 
//		Query.Text = StrReplace(Query.Text, "&DocTypeFilter", "VALUETYPE(Basis) = TYPE(Document.PurchaseInvoice)");
//	ElsIf CurrentTransactionType = Enums.AccrualsTransactionType.Void 
//		Or CurrentTransactionType = Enums.AccrualsTransactionType.Reverse Then
//		Query.Text = StrReplace(Query.Text, "&DocTypeFilter", "VALUETYPE(Basis) = TYPE(Document.ExpenseAccruals)");
//	Else
//		Query.Text = StrReplace(Query.Text, "&DocTypeFilter", "True");
//	EndIf;
//	
	BalancePeriod = Undefined;
	If ValueIsFilled(Parameters.Ref) And Parameters.Ref.Posted Then
		BalancePeriod = New Boundary(Parameters.Ref.PointInTime(), BoundaryType.Excluding);
	Else
		BalancePeriod = CommonFunctionsServer.GetCurrentSessionDate();
	EndIf;
	Query.SetParameter("BalancePeriod", BalancePeriod);
	QueryResult = Query.Execute();
	QuerySelection_Document = QueryResult.Select(QueryResultIteration.ByGroups);
	While QuerySelection_Document.Next() Do
		
		NewRow = ExpenseValueTable.Add();
		FillPropertyValues(NewRow, QuerySelection_Document);
		
	EndDo;
EndProcedure

#EndRegion
